%include 'in_out.asm' 			; подключение внешнего файла

	SECTION .data 			; секция инициированных данных
	msg: DB 'Введите значение переменной х: ',0
	rem: DB 'Результат: ',0
	SECTION .bss 			; секция не инициированных данных
	x: RESB 80 			; переменная, значение к-рой будем вводить 
					; с клавиатуры, выделенный размер - 80 байт

	SECTION .text 			; код программы
	GLOBAL _start 			; начало программы
	_start: 			; точка входа в программу

; ---- Вычисление выражения
	mov eax, msg 			; запись адреса выводимиого сообщения в eax
	call sprint 			; вызов подпрограммы печати сообщения
	mov ecx, x 			; запись адреса переменной в ecx
	mov edx, 80 			; запись длины вводимого значения в edx
	call sread 			; вызов подпрограммы ввода сообщения
	mov eax,x 			; вызов подпрограммы преобразования
	call atoi 			; ASCII кода в число, `eax=x`
	
	add eax,10
	imul eax,3
	sub eax,20
	
	mov edi,eax 			; запись результата вычисления в 'edi'

; ---- Вывод результата на экран
	mov eax,rem 			; вызов подпрограммы печати сообщения 'Результат: '
	call sprint 
	mov eax,edi 			; вызов подпрограммы печати значения
	call iprintLF 			; из 'edi' в виде символов
	
	call quit 			; вызов подпрограммы завершения


